posts/solving-riddles/index.org
#+BEGIN_COMMENT
.. title: Solving riddles
.. slug: solving-riddles
.. date: 2020-10-24 20:47:02 UTC+02:00
.. tags:
.. category:
.. link:
.. description:
.. type: text
.. has_math: true

#+END_COMMENT

#+TITLE:     Solving Logical Riddles with PyEDA
#+AUTHOR:    Nicky van Foreest
#+EMAIL:     vanforeest@gmail.com
#+DATE:      2020-07-14

#+LANGUAGE:  en
#+OPTIONS:  H:2 toc:t num:t

#+LATEX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage{a4wide}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \setminted[python]{linenos=true}
#+LATEX_HEADER: \setminted[python]{frame=lines}
#+LATEX_HEADER: \usepackage{fouriernc}


#+STARTUP: showall
#+PROPERTY: header-args:python :session
#+PROPERTY: header-args:python+ :exports both
#+PROPERTY: header-args:python+ :results output

* Introduction

Here is a funny riddle: An island has two types of inhabitants: knights and crooks.
Knights always tell the truth, crooks always lie.
Suppose an inhabitant A claims about himself and his brother B: "At least one of us is a crook."
Of which type are A and B?

Below we solve this riddle by hand, but, as becomes clear, this is a bit tedious.
Can't we use the computer to solve problems like this?
In fact, [[https://pypi.org/project/pyeda/][PyEDA]] is a package to solve such /constraint satisfaction/ problems, in particular problems that can be formulated with /Boolean algebra/.
Here we show how to use this package to attack such logical riddles.


* Riddle: At least one of us is a crook


The above logical problem can be solved in a nice way with Boolean algebra.
Let $A=1$ if person A is a knight, and $A=0$ if he is a crook, and similar for $B$.
With these variables, and writing $A'$ for the complement of $A$, the statement of person A can be written as
\begin{equation*}
   C = A B' + A' B + A' B'.
\end{equation*}
Now, if A is a knight, he speaks the truth; and then, by consequence, claim $C$ must be true.
Thus, if $A=1$, it must be that $A  C = 1$.
On the other hand, if A is a crook, he lies, so that claim $C$ is false (and $C'$ is true.)
Thus, if $A'=1$ (i.e., person A is a crook), it must be that $A' C' = 1$. Since also A is a knight or a crook, either $AC=1$ or $A'C'=1$, implying that
\begin{equation*}
1 = AC + A'C'.
\end{equation*}
With this insight, the riddle can be formulated as: for which $A$ and $B$ is this  equation true?


Let's solve it by hand for instructional purposes. With the above expression for $C$ and noting that $C' = A B'$, our problem can be rewritten as
\begin{equation*}
1 = AC + A'C' =  A( A B' + A' B + A' B') + A'( A B').
\end{equation*}
Clearly, $A A' = 0$ and $A A = A$, so that this must reduce to
2\begin{equation*}
A B' = 1,
\end{equation*}
from which follows that $A=1$, i.e., A is a knight, and $B'=1$, i.e., B is a crook.

Let's check this with PyEDA.

#+BEGIN_SRC python
from pyeda.inter import exprvar

A, B = map(exprvar, 'AB')
#+END_SRC

#+RESULTS:



The statement $C$ can be written in PyEDA as:

#+BEGIN_SRC python
C = A & ~B | ~A & B | ~A & ~B
#+END_SRC

#+RESULTS:


and the statement we want to check is

#+BEGIN_SRC python
S = A&C | ~A&~C
#+END_SRC

#+RESULTS:


Let's solve it:

#+BEGIN_SRC python
for x in S.satisfy_all():
   print(x)
#+END_SRC


#+RESULTS:
: {B: 0, A: 1}


We get the same result: $A=1$, i.e., A is a knight, and $B=0$, i.e., B is a crook.

