posts/solving-riddles/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article#
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Solving riddles | Nicky's site</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://ndvanforeest.github.io/posts/solving-riddles/">
<!--[if lt IE 9]><![endif]--><link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css">
<link rel="stylesheet" href="https://cdn.rawgit.com/jpswalsh/academicons/master/css/academicons.min.css">
<meta name="author" content="Nicky van Foreest">
<link rel="prev" href="../links-in-nikola-and-orgmode/" title="links in nikola and orgmode" type="text/html">
<meta property="og:site_name" content="Nicky's site">
<meta property="og:title" content="Solving riddles">
<meta property="og:url" content="https://ndvanforeest.github.io/posts/solving-riddles/">
<meta property="og:description" content="Table of Contents


1. Introduction
2. Riddle: At least one of us is a crook
3. Riddle: Exactly one of us is a crook
4. Riddle:  Knights of the same type
5. Riddle: Number of knights in a bus
6. Riddl">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-10-24T20:47:02+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-expand-md static-top mb-4
navbar-dark
bg-dark
"><div class="container">
<!-- This keeps the margins nice -->
        <a class="navbar-brand" href="../../">

            <span id="blog-title">Nicky's site</span>
        </a>
        <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
            <span class="navbar-toggler-icon"></span>
        </button>

        <div class="collapse navbar-collapse" id="bs-navbar">
            <ul class="navbar-nav mr-auto">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../bio/" class="nav-link">Bio</a>
                </li>
<li class="nav-item">
<a href="../../books/" class="nav-link">Books</a>
                </li>
<li class="nav-item">
<a href="../../presentations/" class="nav-link">Presentations</a>
                </li>
<li class="nav-item">
<a href="../../sites/" class="nav-link">Sites</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../tools/" class="nav-link">Tools</a>

                
            </li>
</ul>
<ul class="navbar-nav navbar-right">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Solving riddles</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Nicky van Foreest
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2020-10-24T20:47:02+02:00" itemprop="datePublished" title="2020-10-24 20:47">2020-10-24 20:47</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org43dbf8e">1. Introduction</a></li>
<li><a href="#org6ba58e6">2. Riddle: At least one of us is a crook</a></li>
<li><a href="#org5365408">3. Riddle: Exactly one of us is a crook</a></li>
<li><a href="#orgdd05421">4. Riddle:  Knights of the same type</a></li>
<li><a href="#org4989715">5. Riddle: Number of knights in a bus</a></li>
<li><a href="#orgf8b2db0">6. Riddle: Boxes with chips</a></li>
</ul>
</div>
</div>

<div id="outline-container-org43dbf8e" class="outline-2">
<h2 id="org43dbf8e">
<span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Here is a funny riddle: An island has two types of inhabitants: knights and crooks.
Knights always tell the truth, crooks always lie.
Suppose an inhabitant A claims about himself and his brother B: "At least one of us is a crook."
nOf which type are A and B?
</p>

<p>
Below we solve this riddle by hand, but, as becomes clear, this is a bit tedious.
Can't we use the computer to solve problems like this?
In fact, <a href="https://pypi.org/project/pyeda/">PyEDA</a> is a package to solve such <i>constraint satisfaction</i> problems, in particular problems that can be formulated with <i>Boolean algebra</i>.
Here we show how to use this package to attack such logical riddles.
</p>
</div>
</div>


<div id="outline-container-org6ba58e6" class="outline-2">
<h2 id="org6ba58e6">
<span class="section-number-2">2</span> Riddle: At least one of us is a crook</h2>
<div class="outline-text-2" id="text-2">
<p>
The above logical problem can be solved in a nice way with Boolean algebra.
Let \(A=1\) if person A is a knight, and \(A=0\) if he is a crook, and similar for \(B\).
With these variables, and writing \(A'\) for the complement of \(A\), the statement of person A can be written as
</p>
\begin{equation*}
   C = A B' + A' B + A' B'.
\end{equation*}
<p>
Now, if A is a knight, he speaks the truth; and then, by consequence, claim \(C\) must be true.
Thus, if \(A=1\), it must be that \(A  C = 1\). 
On the other hand, if A is a crook, he lies, so that claim \(C\) is false (and \(C'\) is true.)
Thus, if \(A'=1\) (i.e., person A is a crook), it must be that \(A' C' = 1\). Since also A is a knight or a crook, either \(AC=1\) or \(A'C'=1\), implying that 
</p>
\begin{equation*}
1 = AC + A'C'.
\end{equation*}
<p>
With this insight, the riddle can be formulated as: for which \(A\) and \(B\) is this  equation true?
</p>


<p>
Let's solve it by hand for instructional purposes. With the above expression for \(C\) and noting that \(C' = A B'\), our problem can be rewritten as
</p>
\begin{equation*}
1 = AC + A'C' =  A( A B' + A' B + A' B') + A'( A B').
\end{equation*}
<p>
Clearly, \(A A' = 0\) and \(A A = A\), so that this must reduce to
2\begin{equation*}
A B' = 1,
\end{equation*}
from which follows that \(A=1\), i.e., A is a knight, and \(B'=1\), i.e., B is a crook.
</p>

<p>
Let's check this with PyEDA.
</p>

<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">pyeda.inter</span> <span class="kn">import</span> <span class="n">exprvar</span>

<span class="n">A</span><span class="p">,</span> <span class="n">B</span> <span class="o">=</span> <span class="nb">map</span><span class="p">(</span><span class="n">exprvar</span><span class="p">,</span> <span class="s1">'AB'</span><span class="p">)</span>
</pre></div>

<p>
The statement \(C\) can be written in PyEDA as:
</p>

<div class="highlight"><pre><span></span><span class="n">C</span> <span class="o">=</span> <span class="n">A</span> <span class="o">&amp;</span> <span class="o">~</span><span class="n">B</span> <span class="o">|</span> <span class="o">~</span><span class="n">A</span> <span class="o">&amp;</span> <span class="n">B</span> <span class="o">|</span> <span class="o">~</span><span class="n">A</span> <span class="o">&amp;</span> <span class="o">~</span><span class="n">B</span>
</pre></div>

<p>
and the statement we want to check is
</p>

<div class="highlight"><pre><span></span><span class="n">S</span> <span class="o">=</span> <span class="n">A</span><span class="o">&amp;</span><span class="n">C</span> <span class="o">|</span> <span class="o">~</span><span class="n">A</span><span class="o">&amp;~</span><span class="n">C</span>
</pre></div>

<p>
Let's solve it:
</p>

<div class="highlight"><pre><span></span><span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">S</span><span class="o">.</span><span class="n">satisfy_all</span><span class="p">():</span>
   <span class="nb">print</span><span class="p">(</span><span class="n">x</span><span class="p">)</span>
</pre></div>


<pre class="example">
{B: 0, A: 1}

</pre>


<p>
We get the same result: \(A=1\), i.e., A is a knight, and \(B=0\), i.e., B is a crook.
</p>
</div>
</div>
