posts/solving-riddles/index.org
* Riddle: Exactly one of us is a crook

Now that we know how to tackle such riddles in an instant with PyEDA
we can move on to the next riddle.

Suppose that, instead of the above, A said: "Precisely one of us is a crook." What can we say about A and B now?

The statement of A can now be modelled as $C=A'B + AB'$.
#+BEGIN_SRC python
C = ~A & B | A&~B
#+END_SRC

#+RESULTS[9617534312a0e5aef391ca615bc7b5fa2c5e767d]:

And we want again that the following is satisfied:
#+BEGIN_SRC python
S = A&C | ~A&~C

for x in S.satisfy_all():
   print(x)
#+END_SRC

#+RESULTS:
: {B: 0, A: 0}
: {B: 0, A: 1}

Apperently, the statement of A that only one of the two brothers is a crook allows two solutions.
We can only conclude that B is a crook.


It is interesting to note that there's a boolean function in PyEDA to build claim C in another way.
Note that according to C, precisely one of A and B is true.
This behavior can be obtained with `OneHot`.

#+BEGIN_SRC python
from pyeda.inter import OneHot

D = OneHot(A,B)
print(D)
#+END_SRC

#+RESULTS:
: And(Or(~A, ~B), Or(A, B))



* Riddle:  Knights of the same type

What if A has said that: "My brother and I are of the same type".

#+BEGIN_SRC python
C = A & B | ~A&~B
S = A&C | ~A&~C

for x in S.satisfy_all():
   print(x)
#+END_SRC

#+RESULTS:
: {B: 1, A: 0}
: {B: 1, A: 1}


So, now B is a knight, but A can be either of the two.

* Riddle: Number of knights in a bus

Eleven inhabitants of the island are sitting in a bus. All of them
know each other. When asked about the number of knights in the bus
they answered: 3, 2, 5, 7, 5, 3, 4, 0, 3, 5, 5. How many knights are sitting in the bus?

To solve this with PyEDA, we can use the function 'NHot', provided to
me by the author of PyEDA:

#+BEGIN_SRC python
import itertools

from pyeda.inter import Expression, exprvars
from pyeda.boolalg import exprnode
from pyeda.boolalg.expr import _expr

def NHot(n, *xs, simplify=True):
    """
    Return an expression that means
    "exactly N input functions are true".
    """
    xs = {Expression.box(x).node for x in xs}
    terms = list()
    for hots in itertools.combinations(xs, n):
        args = hots + tuple(exprnode.not_(cold) for cold in (xs - set(hots)))
        terms.append(exprnode.and_(*args))
    y = exprnode.or_(*terms)
    if simplify:
        y = y.simplify()
    return _expr(y)
#+END_SRC

#+RESULTS[65e8988f7813afff28358db11c1d4ca1d705d35f]:

Let $X$ be a vector of 11 Boolean variables such that $X_{i}=1$ if inhabitant $i$ is a knight.
#+BEGIN_SRC python
X = exprvars('X', 11)

Answers = [3, 2, 5, 7, 5, 3, 4, 0, 3, 5, 5]
#+END_SRC

#+RESULTS:




The problem can be solved by a straigtforward generalization of the solution of the above riddles.
#+BEGIN_SRC python
S = 1
for i, a in enumerate(Answers):
    S = S & (X[i]&NHot(Answers[i], *X) | ~X[i]&~NHot(Answers[i], *X))

for x in S.satisfy_all():
    for y in x:
        print(y, x[y])
#+END_SRC

#+RESULTS:
#+begin_example
X[10] 0
X[9] 0
X[8] 1
X[7] 0
X[6] 0
X[5] 1
X[4] 0
X[3] 0
X[2] 0
X[1] 0
X[0] 1
#+end_example


As $X_{0}=1$ there must be three knights in the bus (and this checks with the other answers).



