posts/solving-riddles/index.html

<div id="outline-container-org5365408" class="outline-2">
<h2 id="org5365408">
<span class="section-number-2">3</span> Riddle: Exactly one of us is a crook</h2>
<div class="outline-text-2" id="text-3">
<p>
Now that we know how to tackle such riddles in an instant with PyEDA
we can move on to the next riddle.
</p>

<p>
Suppose that, instead of the above, A said: "Precisely one of us is a crook." What can we say about A and B now? 
</p>

<p>
The statement of A can now be modelled as \(C=A'B + AB'\). 
</p>
<div class="highlight"><pre><span></span><span class="n">C</span> <span class="o">=</span> <span class="o">~</span><span class="n">A</span> <span class="o">&amp;</span> <span class="n">B</span> <span class="o">|</span> <span class="n">A</span><span class="o">&amp;~</span><span class="n">B</span>
</pre></div>

<p>
And we want again that the following is satisfied: 
</p>
<div class="highlight"><pre><span></span><span class="n">S</span> <span class="o">=</span> <span class="n">A</span><span class="o">&amp;</span><span class="n">C</span> <span class="o">|</span> <span class="o">~</span><span class="n">A</span><span class="o">&amp;~</span><span class="n">C</span>

<span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">S</span><span class="o">.</span><span class="n">satisfy_all</span><span class="p">():</span>
   <span class="nb">print</span><span class="p">(</span><span class="n">x</span><span class="p">)</span>
</pre></div>

<pre class="example">
{B: 0, A: 0}
{B: 0, A: 1}

</pre>

<p>
Apperently, the statement of A that only one of the two brothers is a crook allows two solutions.
We can only conclude that B is a crook.
</p>


<p>
It is interesting to note that there's a boolean function in PyEDA to build claim C in another way.
Note that according to C, precisely one of A and B is true.
This behavior can be obtained with `OneHot`.
</p>

<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">pyeda.inter</span> <span class="kn">import</span> <span class="n">OneHot</span>

<span class="n">D</span> <span class="o">=</span> <span class="n">OneHot</span><span class="p">(</span><span class="n">A</span><span class="p">,</span><span class="n">B</span><span class="p">)</span>
<span class="nb">print</span><span class="p">(</span><span class="n">D</span><span class="p">)</span>
</pre></div>

<pre class="example">
And(Or(~A, ~B), Or(A, B))

</pre>
</div>
</div>



<div id="outline-container-orgdd05421" class="outline-2">
<h2 id="orgdd05421">
<span class="section-number-2">4</span> Riddle:  Knights of the same type</h2>
<div class="outline-text-2" id="text-4">
<p>
What if A has said that: "My brother and I are of the same type".
</p>

<div class="highlight"><pre><span></span><span class="n">C</span> <span class="o">=</span> <span class="n">A</span> <span class="o">&amp;</span> <span class="n">B</span> <span class="o">|</span> <span class="o">~</span><span class="n">A</span><span class="o">&amp;~</span><span class="n">B</span>
<span class="n">S</span> <span class="o">=</span> <span class="n">A</span><span class="o">&amp;</span><span class="n">C</span> <span class="o">|</span> <span class="o">~</span><span class="n">A</span><span class="o">&amp;~</span><span class="n">C</span>

<span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">S</span><span class="o">.</span><span class="n">satisfy_all</span><span class="p">():</span>
   <span class="nb">print</span><span class="p">(</span><span class="n">x</span><span class="p">)</span>
</pre></div>

<pre class="example">
{B: 1, A: 0}
{B: 1, A: 1}

</pre>


<p>
So, now B is a knight, but A can be either of the two.
</p>
</div>
</div>

<div id="outline-container-org4989715" class="outline-2">
<h2 id="org4989715">
<span class="section-number-2">5</span> Riddle: Number of knights in a bus</h2>
<div class="outline-text-2" id="text-5">
<p>
Eleven inhabitants of the island are sitting in a bus. All of them
know each other. When asked about the number of knights in the bus
they answered: 3, 2, 5, 7, 5, 3, 4, 0, 3, 5, 5. How many knights are sitting in the bus? 
</p>

<p>
To solve this with PyEDA, we can use the function 'NHot', provided to
me by the author of PyEDA:
</p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">itertools</span>

<span class="kn">from</span> <span class="nn">pyeda.inter</span> <span class="kn">import</span> <span class="n">Expression</span><span class="p">,</span> <span class="n">exprvars</span>
<span class="kn">from</span> <span class="nn">pyeda.boolalg</span> <span class="kn">import</span> <span class="n">exprnode</span>
<span class="kn">from</span> <span class="nn">pyeda.boolalg.expr</span> <span class="kn">import</span> <span class="n">_expr</span>

<span class="k">def</span> <span class="nf">NHot</span><span class="p">(</span><span class="n">n</span><span class="p">,</span> <span class="o">*</span><span class="n">xs</span><span class="p">,</span> <span class="n">simplify</span><span class="o">=</span><span class="kc">True</span><span class="p">):</span>
    <span class="sd">"""</span>
<span class="sd">    Return an expression that means</span>
<span class="sd">    "exactly N input functions are true".</span>
<span class="sd">    """</span>
    <span class="n">xs</span> <span class="o">=</span> <span class="p">{</span><span class="n">Expression</span><span class="o">.</span><span class="n">box</span><span class="p">(</span><span class="n">x</span><span class="p">)</span><span class="o">.</span><span class="n">node</span> <span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">xs</span><span class="p">}</span>
    <span class="n">terms</span> <span class="o">=</span> <span class="nb">list</span><span class="p">()</span>
    <span class="k">for</span> <span class="n">hots</span> <span class="ow">in</span> <span class="n">itertools</span><span class="o">.</span><span class="n">combinations</span><span class="p">(</span><span class="n">xs</span><span class="p">,</span> <span class="n">n</span><span class="p">):</span>
	<span class="n">args</span> <span class="o">=</span> <span class="n">hots</span> <span class="o">+</span> <span class="nb">tuple</span><span class="p">(</span><span class="n">exprnode</span><span class="o">.</span><span class="n">not_</span><span class="p">(</span><span class="n">cold</span><span class="p">)</span> <span class="k">for</span> <span class="n">cold</span> <span class="ow">in</span> <span class="p">(</span><span class="n">xs</span> <span class="o">-</span> <span class="nb">set</span><span class="p">(</span><span class="n">hots</span><span class="p">)))</span>
	<span class="n">terms</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">exprnode</span><span class="o">.</span><span class="n">and_</span><span class="p">(</span><span class="o">*</span><span class="n">args</span><span class="p">))</span>
    <span class="n">y</span> <span class="o">=</span> <span class="n">exprnode</span><span class="o">.</span><span class="n">or_</span><span class="p">(</span><span class="o">*</span><span class="n">terms</span><span class="p">)</span>
    <span class="k">if</span> <span class="n">simplify</span><span class="p">:</span>
	<span class="n">y</span> <span class="o">=</span> <span class="n">y</span><span class="o">.</span><span class="n">simplify</span><span class="p">()</span>
    <span class="k">return</span> <span class="n">_expr</span><span class="p">(</span><span class="n">y</span><span class="p">)</span>
</pre></div>

<p>
Let \(X\) be a vector of 11 Boolean variables such that \(X_{i}=1\) if inhabitant \(i\) is a knight.
</p>
<div class="highlight"><pre><span></span><span class="n">X</span> <span class="o">=</span> <span class="n">exprvars</span><span class="p">(</span><span class="s1">'X'</span><span class="p">,</span> <span class="mi">11</span><span class="p">)</span>

<span class="n">Answers</span> <span class="o">=</span> <span class="p">[</span><span class="mi">3</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">5</span><span class="p">,</span> <span class="mi">7</span><span class="p">,</span> <span class="mi">5</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="mi">4</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="mi">5</span><span class="p">,</span> <span class="mi">5</span><span class="p">]</span>
</pre></div>

<p>
The problem can be solved by a straigtforward generalization of the solution of the above riddles.
</p>
<div class="highlight"><pre><span></span><span class="n">S</span> <span class="o">=</span> <span class="mi">1</span> 
<span class="k">for</span> <span class="n">i</span><span class="p">,</span> <span class="n">a</span> <span class="ow">in</span> <span class="nb">enumerate</span><span class="p">(</span><span class="n">Answers</span><span class="p">):</span>
    <span class="n">S</span> <span class="o">=</span> <span class="n">S</span> <span class="o">&amp;</span> <span class="p">(</span><span class="n">X</span><span class="p">[</span><span class="n">i</span><span class="p">]</span><span class="o">&amp;</span><span class="n">NHot</span><span class="p">(</span><span class="n">Answers</span><span class="p">[</span><span class="n">i</span><span class="p">],</span> <span class="o">*</span><span class="n">X</span><span class="p">)</span> <span class="o">|</span> <span class="o">~</span><span class="n">X</span><span class="p">[</span><span class="n">i</span><span class="p">]</span><span class="o">&amp;~</span><span class="n">NHot</span><span class="p">(</span><span class="n">Answers</span><span class="p">[</span><span class="n">i</span><span class="p">],</span> <span class="o">*</span><span class="n">X</span><span class="p">))</span>

<span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">S</span><span class="o">.</span><span class="n">satisfy_all</span><span class="p">():</span>
    <span class="k">for</span> <span class="n">y</span> <span class="ow">in</span> <span class="n">x</span><span class="p">:</span>
	<span class="nb">print</span><span class="p">(</span><span class="n">y</span><span class="p">,</span> <span class="n">x</span><span class="p">[</span><span class="n">y</span><span class="p">])</span>
</pre></div>

<pre class="example">
X[10] 0
X[9] 0
X[8] 1
X[7] 0
X[6] 0
X[5] 1
X[4] 0
X[3] 0
X[2] 0
X[1] 0
X[0] 1
</pre>


<p>
As \(X_{0}=1\) there must be three knights in the bus (and this checks with the other answers). 
</p>
</div>
</div>
