posts/solving-riddles/index.org
* Riddle: Boxes with chips

P.J.
Nahin describes a few interesting puzzles in his book "The Logician and the Engineer, How George Boole and Claude Shannon Created the Information Age".
Here is puzzle 1.

On the table before you are three small boxes, labeled A, B , and C.
Inside each box is a colored plastic chip.
One chip is red, one is white, and one is blue.
You do not know which chip is in which box.
Then, you are told that of the next three statements, exactly one is true:
1. box A contains the red chip;
2. box B does not contain the red chip;
3. box C does not contain the blue chip.

Determine the color of the chip in each box.

To solve this problem with Boolean logic, Nahin introduces, in Chapter 4, the variable $Ar$: if $Ar=1$, then box A contains the red chip, and $Ar=0$ otherwise.
Likewise variables are defined for the other boxes and chips.

#+BEGIN_SRC python
Ar, Ab, Aw = map(exprvar, ('Ar', 'Ab', 'Aw'))
Br, Bb, Bw = map(exprvar, ('Br', 'Bb', 'Bw'))
Cr, Cb, Cw = map(exprvar, ('Cr', 'Cb', 'Cw'))
#+END_SRC

#+RESULTS[f301c5a55d75460c95f1d900228a99ac1ac88dce]:

The given info above can be written as:
#+BEGIN_SRC python
Info = OneHot(Ar, ~Br, ~Cb)
#+END_SRC

#+RESULTS:


There are some, implicit, but obvious constraints to be satisfied. Each of the chips is in precisely one box:

#+BEGIN_SRC python
r = OneHot(Ar, Br, Cr)  # the red chip is in precisely one box
b = OneHot(Ab, Bb, Cb)
w = OneHot(Aw, Bw, Cw)
#+END_SRC

#+RESULTS:



A box contains precisely one chip.

#+BEGIN_SRC python
A = OneHot(Ar, Ab, Aw)
B = OneHot(Br, Bb, Bw)
C = OneHot(Cr, Cb, Cw)
#+END_SRC

#+RESULTS:


Finally, the given info and all the constraints have to be true simultaneously.

#+BEGIN_SRC python
S = r & b & w & A & B & C & Info
#+END_SRC

#+RESULTS:


Solve it:
#+BEGIN_SRC python
for x in S.satisfy_all():
   print(x)
#+END_SRC

#+RESULTS:
: {Cw: 1, Cb: 0, Cr: 0, Bw: 0, Bb: 0, Br: 1, Aw: 0, Ab: 1, Ar: 0}


This was easy! Box A contains the blue chip, Box B the red chip, and Box C the white chip.


* Build the file :noexport:

** pdf

# +BEGIN_SRC emacs-lisp :results none
(org-open-file (org-latex-export-to-pdf))
#+END_SRC

** Markdown

#+BEGIN_SRC emacs-lisp
(org-open-file (org-md-export-to-markdown))
#+END_SRC

#+RESULTS:
